# FabricationConnectorInfo Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationConnectorInfo Members
FabricationConnectorInfo Class Methods Properties See Also
---
The FabricationConnectorInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FabricationConnectorInfo |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| HasDoubleWallConnector | Checks if there are any double wall connectors fabricated. |
| IsValid | Checks if the connector has fabrication parameters associated with it that can be set. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BodyConnectorId | Fabrication body connector Id. |
| DoubleWallConnectorId | Fabrication double wall connector Id. |
| FabricationIndex | The index of the connector shown within the fabrication software. |
| IsBodyConnectorLocked | Fabrication body connector lock. |
| IsDoubleWallConnectorLocked | Fabrication double wall connector lock. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace